trade_exp/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоступлениеОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрироватьЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиДляПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КроссДокинг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30a590e2-6596-4de0-a4be-cfbb5399d172">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f8ead0eb-21aa-4e1f-8164-ee742c343e92">
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cdedb2c-9438-46bb-96fb-6a845d8582f4">
    <name>СуммаВозвратнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d98fbb64-76a2-40b3-b574-49c707b7bcb3">
    <name>ДатаПервогоПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="acabeecd-5076-4d22-9652-a2ee1ee153df">
    <name>СуммаПредоплатыДоПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2d778d9-a008-4546-b5fa-9b25ddc9609f">
    <name>СуммаАвансаДоПодтверждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e13b4eca-d382-4210-b95b-b08bc5825d14">
    <name>ДокументыОтСкладаПолучены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31d4229d-7e07-4e4a-9f92-1976c47d4f63">
    <name>ВесПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dece339b-2105-4c98-a2e4-1f5dcc38566a">
    <name>ОбъемПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="165cb2b7-35c2-43ff-87ab-494ece2907a0">
    <name>Норматив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="92683317-6424-449c-bc95-666f2f041e6c">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1909ef6d-dda2-4d5f-9cf1-9de8ee7d90e4">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="986908c6-9d6d-4369-9adc-da7c74e6cc10">
    <name>ОтключитьКонтрольЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b9a0f800-6f65-4509-aec7-1670f5b445be">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b9741a38-d099-44b3-80ee-269109b8ccbf">
    <name>ДлительностьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="22123465-b48b-4cb0-9380-1ebabf57bf68">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fc2995a3-f83e-4468-8f9a-ab580932140a">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5485e49-b94a-46f3-aa70-100271167e47">
    <name>НомерПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СписатьНаРасходы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fb7178d5-075f-4bff-bd5e-69dd3c98eeb0">
      <name>НоменклатураПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="936553b0-c400-4185-a80f-e05eba62422e">
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>ТоварыИсходная</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="062883fc-ecd3-4fff-bee1-24c39065e066">
    <name>ПисьмаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="00b8aece-fe81-4c6a-957f-030bed24e14c">
      <name>ПисьмоПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/CommonForms/Док_ОформлениеРасхождений/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоФактПриИзменении(Элемент)
ПересчитатьРасхожденияПланаИФакта();	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда 
		ДокументОснование = Параметры.Документ;
	КонецЕсли;

	Товары.Загрузить(ЗаполнитьТабличнуюЧасть(ДокументОснование));
	
	ЗаполнитьРасхождения();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьТабличнуюЧасть(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.КодСтроки КАК КодСтроки,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	0 КАК КоличествоФакт,
		|	0 КАК КоличествоБрак
		|ПОМЕСТИТЬ ВТ_ТоварыПоОснованию
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
		|	И ЗаказПоставщикуТовары.Отменено = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.КодСтроки,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.Характеристика,
		|	ПеремещениеТоваровТовары.КоличествоУпаковок,
		|	0,
		|	0
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыПоОснованию.КодСтроки КАК КодСтроки,
		|	ВТ_ТоварыПоОснованию.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыПоОснованию.Характеристика КАК Характеристика,
		|	СУММА(ВТ_ТоварыПоОснованию.КоличествоУпаковок) КАК Количество,
		|	СУММА(ВТ_ТоварыПоОснованию.КоличествоФакт) КАК КоличествоФакт,
		|	СУММА(ВТ_ТоварыПоОснованию.КоличествоБрак) КАК КоличествоБрак
		|ИЗ
		|	ВТ_ТоварыПоОснованию КАК ВТ_ТоварыПоОснованию
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыПоОснованию.КодСтроки,
		|	ВТ_ТоварыПоОснованию.Номенклатура,
		|	ВТ_ТоварыПоОснованию.Характеристика";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	Возврат РезультатЗапроса;	
	
КонецФункции

&НаСервере
Процедура ВыбратьОтменитьВсеНаСервере(ВыбратьИлиОтменитьЗначение)
	ТЗ = Товары.Выгрузить();
	ТЗ.ЗаполнитьЗначения(ВыбратьИлиОтменитьЗначение,"Выбрать");
	Товары.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеИлиОтменитьВыборПриИзменении(Элемент)
	ВыбратьОтменитьВсеНаСервере(ВыбратьВсеИлиОтменитьВыбор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоФактПоПлану(Команда)
	 ВывестиВопросОбработкаВыбранныхИлиВсех("ЗаполнениеКоличестваФактическогоПоПлановому");
	 ЗаполнитьРасхождения();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиВопросОбработкаВыбранныхИлиВсех(ВыбранныйВариантДействий)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбранныхИлиВсех", ЭтотОбъект,ВыбранныйВариантДействий);
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(КодВозвратаДиалога.Нет,"Выбранные");
	СписокЗначений.Добавить(КодВозвратаДиалога.Да,"Все");
	СписокЗначений.Добавить(КодВозвратаДиалога.Отмена,"Отменить");
	
    ПоказатьВопрос(Оповещение,"Обработать выбранные строки или все?",СписокЗначений, 0,КодВозвратаДиалога.Да); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбранныхИлиВсех(Результат, Параметры) Экспорт
	
	ОбработкаТолькоВыбранных = Ложь;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьВыбранныйВариантОформления(ОбработкаТолькоВыбранных,Параметры);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ОбработкаТолькоВыбранных = Истина;
		ОбработатьВыбранныйВариантОформления(ОбработкаТолькоВыбранных,Параметры);		
	КонецЕсли;	
 
КонецПроцедуры

Процедура ОбработатьВыбранныйВариантОформления(ОбработкаТолькоВыбранных,ВыбранныйВариантДействий)
	
	Если ВыбранныйВариантДействий = "ЗаполнениеКоличестваФактическогоПоПлановому" Тогда  
		Для каждого Строка из Товары Цикл
			Если ОбработкаТолькоВыбранных Тогда
				Если Строка.Выбрать Тогда
					Строка.КоличествоФакт = Строка.Количество;
				КонецЕсли;
			Иначе
				Строка.КоличествоФакт = Строка.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ВыбранныйВариантДействий = "ОчищениеКоличестваФакт" Тогда  
		Для каждого Строка из Товары Цикл
			Если ОбработкаТолькоВыбранных Тогда
				Если Строка.Выбрать Тогда
					Строка.КоличествоФакт = 0;
				КонецЕсли;
			Иначе
				Строка.КоличествоФакт = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ВыбранныйВариантДействий = "ОчищениеКоличестваБрак" Тогда  
		Для каждого Строка из Товары Цикл
			Если ОбработкаТолькоВыбранных Тогда
				Если Строка.Выбрать Тогда
					Строка.КоличествоБрак = 0;
				КонецЕсли;
			Иначе
				Строка.КоличествоБрак = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКоличествоФакт(Команда)
	ВывестиВопросОбработкаВыбранныхИлиВсех("ОчищениеКоличестваФакт");
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьРасхожденияПланаИФакта()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока.Количество > ТекущаяСтрока.КоличествоФакт Тогда
			ТекущаяСтрока.Расхождение = ТекущаяСтрока.Количество - ТекущаяСтрока.КоличествоФакт;
			ТекущаяСтрока.Описание = "Недостачи";
		ИначеЕсли ТекущаяСтрока.Количество < ТекущаяСтрока.КоличествоФакт Тогда
			ТекущаяСтрока.Расхождение = ТекущаяСтрока.КоличествоФакт - ТекущаяСтрока.Количество;
			ТекущаяСтрока.Описание = "Излишки";
		Иначе
			ТекущаяСтрока.Расхождение = 0;
			ТекущаяСтрока.Описание = "";
	КонецЕсли;

	Если ТекущаяСтрока.КоличествоБрак > 0 Тогда
			ТекущаяСтрока.Описание = ТекущаяСтрока.Описание + ?(ПустаяСтрока(ТекущаяСтрока.Описание) = Истина, "Брак", ", Брак");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерезаполнитьТабличнуюЧасть(Команда)
	
	ПерезаполнитьТабличнуюЧастьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТабличнуюЧастьНаСервере()
	
	Товары.Загрузить(ЗаполнитьТабличнуюЧасть(ДокументОснование));
	
	ЗаполнитьРасхождения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКоличествоБрак(Команда)
	ВывестиВопросОбработкаВыбранныхИлиВсех("ОчищениеКоличестваБрак");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасхождения()
	
	Для каждого Строка из Товары Цикл
			
		Если Строка.Количество > Строка.КоличествоФакт Тогда
			Строка.Расхождение = Строка.Количество - Строка.КоличествоФакт;
			Строка.Описание = "Недостачи";
		ИначеЕсли Строка.Количество < Строка.КоличествоФакт Тогда
			Строка.Расхождение = Строка.КоличествоФакт - Строка.Количество;
			Строка.Описание = "Излишки";
		Иначе
			Строка.Расхождение = 0;
			Строка.Описание = "";
		КонецЕсли;
		
		Если Строка.КоличествоБрак > 0 Тогда
			Строка.Описание = Строка.Описание + ?(ПустаяСтрока(Строка.Описание) = Истина, "Брак", ", Брак");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоБракПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если ТекущаяСтрока.КоличествоБрак > 0 Тогда
			ТекущаяСтрока.Описание = ТекущаяСтрока.Описание + ?(ПустаяСтрока(ТекущаяСтрока.Описание) = Истина, "Брак", ", Брак");
		Иначе
			Если ТекущаяСтрока.Количество > ТекущаяСтрока.КоличествоФакт Тогда
			ТекущаяСтрока.Описание = "Недостачи";
		ИначеЕсли ТекущаяСтрока.Количество < ТекущаяСтрока.КоличествоФакт Тогда
			ТекущаяСтрока.Описание = "Излишки";
	КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоступление(Команда)
	
	ЗаполнитьПоступлениеНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоПоФакту(Команда)
	
	ЗаполнитьПоступлениеНаСервере(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоступлениеНаСервере(ПоФакту=Ложь)
	
	ТоварыКПоступлению.Очистить();
	
	Для каждого Строка из Товары Цикл
		
		НоваяСтрокаПоступления = ТоварыКПоступлению.Добавить();
	    ЗаполнитьЗначенияСвойств(НоваяСтрокаПоступления,Строка);
		Если ПоФакту Тогда
	      НоваяСтрокаПоступления.Количество = Строка.КоличествоФакт;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьНедостачи(Команда)
	ЗаполнитьНедостачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНедостачиНаСервере()
	
	ТоварыКПеремещениюНедостачи.Очистить();
	
	Для каждого Строка из Товары Цикл
		
		Если Строка.Количество > Строка.КоличествоФакт Тогда
			
			НоваяСтрока = ТоварыКПеремещениюНедостачи.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.Количество = Строка.Расхождение;
		
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьБракНаСервере()
	ТоварыКПеремещениюБрак.Очистить();
	
	Для каждого Строка из Товары Цикл
		
		Если Строка.КоличествоБрак > 0 Тогда
			
			НоваяСтрока = ТоварыКПеремещениюБрак.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.Количество = Строка.КоличествоБрак;
		
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьБрак(Команда)
	ЗаполнитьБракНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриобретениеТоваровИУслуг(Команда)
	
	Если ТоварыКПоступлению.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("Поступление");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;
		
КонецПроцедуры

Процедура ПолучитьТЗТовары(ИмяТабличнаяЧасть)
ТоварыИзменитьВПеремещении.Очистить();	
	
Если ИмяТабличнаяЧасть = "ТоварыКПоступлению" Тогда	
ТоварыИзменитьВПеремещении.Загрузить(ТоварыКПоступлению.Выгрузить());
КонецЕсли;

Если ИмяТабличнаяЧасть = "ТоварыКПеремещениюНедостачи" Тогда
ТоварыИзменитьВПеремещении.Загрузить(ТоварыКПеремещениюНедостачи.Выгрузить());
КонецЕсли;

Если ИмяТабличнаяЧасть = "Товары" Тогда
ТоварыИзменитьВПеремещении.Загрузить(Товары.Выгрузить());
КонецЕсли;

Если ИмяТабличнаяЧасть = "ТоварыКПеремещениюБрак" Тогда
ТоварыИзменитьВПеремещении.Загрузить(ТоварыКПеремещениюБрак.Выгрузить());
КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура СоздатьПеремещениеНаСкладНедостачи(Команда)
	
	Если ТоварыКПеремещениюНедостачи.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеНедостачи");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПеремещениеНаСкладБрак(Команда)
	
	Если ТоварыКПеремещениюБрак.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеБрак");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредварительныеДанные(Команда)
	ЗаполнитьПоступлениеНаСервере(Истина);
	ЗаполнитьНедостачиНаСервере();
    ЗаполнитьБракНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиОбработать(Команда)
	
	ЗаполнитьПоступлениеНаСервере(Ложь);
	ЗаполнитьНедостачиНаСервере();
    ЗаполнитьБракНаСервере();
		
	Если ТоварыКПоступлению.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("Поступление");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;

	Если ТоварыКПеремещениюНедостачи.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеНедостачи");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;

	Если ТоварыКПеремещениюБрак.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеБрак");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;

	Закрыть(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Элементы.СозданиеПриобретениеТоваровИУслуг.Видимость=Истина;
		Элементы.ТоварыИзменитьПеремещение.Видимость=Ложь;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Элементы.СозданиеПриобретениеТоваровИУслуг.Видимость=Ложь;
		Элементы.ТоварыИзменитьПеремещение.Видимость=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПеремещение(Команда)
	ЗаполнитьТаблицу();
	Закрыть(ТоварыИзменитьВПеремещении);
КонецПроцедуры

Функция ПолучитьСозданныйДокумент(ТипДокумента)
Если ТипДокумента = "Поступление" Тогда
ТЗ = ТоварыКПоступлению.Выгрузить();
ссылкаНаДок = Альтерра_СкладСервер.СоздатьПриобретениеТоваровУслуг(ДокументОснование, ТЗ);
КонецЕсли;
Если ТипДокумента = "ПеремещениеНедостачи" Тогда
ТЗ = ТоварыКПеремещениюНедостачи.Выгрузить();
СсылкаНаПеремещение = Альтерра_СкладСервер.СоздатьПеремещениеНедостачиБрак(ДокументОснование, ТЗ, Ложь,Истина);
ссылкаНаДок = СсылкаНаПеремещение.Недостачи;
КонецЕсли;
Если ТипДокумента = "ПеремещениеБрак" Тогда
ТЗ = ТоварыКПеремещениюБрак.Выгрузить();
СсылкаНаПеремещение = Альтерра_СкладСервер.СоздатьПеремещениеНедостачиБрак(ДокументОснование, ТЗ, Истина,Ложь);
ссылкаНаДок = СсылкаНаПеремещение.Брак;
КонецЕсли;
Возврат ссылкаНаДок;
КонецФункции


&НаКлиенте
Процедура АвтоматическиОбработатьПоФакту(Команда)
	ЗаполнитьПоступлениеНаСервере(Истина);
    ЗаполнитьБракНаСервере();
		
	Если ТоварыКПоступлению.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("Поступление");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;
	
	Если ТоварыКПеремещениюБрак.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеБрак");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;
	
	Закрыть(Истина);

КонецПроцедуры


&НаКлиенте
Процедура ОтменитьНепоставленныеСтроки(Команда)
	Закрыть(Истина);
КонецПроцедуры

Процедура ЗаполнитьТаблицу()
	
	Если ДокументОснование.ПеремещениеПоЗаказам Тогда
		Для каждого Строка из Товары Цикл
			ПараметрыОтбора = Новый Структура("КодСтроки",Строка.КодСтроки);
			НайденныеСтроки = ДокументОснование.Товары.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()<>0 Тогда
				Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
					Если Строка.КоличествоФакт > 0 Тогда
						Если НайденнаяСтрока.Количество <= Строка.КоличествоФакт Тогда
                            НоваяСтрока1 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
						Если НайденнаяСтрока.Количество < Строка.КоличествоФакт Тогда
							НоваяСтрока2 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока2,НайденнаяСтрока);
							НоваяСтрока2.КодСтроки = 0;
							НоваяСтрока2.Количество = Строка.КоличествоФакт - НайденнаяСтрока.Количество;
							НоваяСтрока2.КоличествоУпаковок = Строка.КоличествоФакт - НайденнаяСтрока.Количество;
						КонецЕсли;
					Иначе
						    НоваяСтрока1 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
							НоваяСтрока1.Количество = Строка.КоличествоФакт;
							НоваяСтрока1.КоличествоУпаковок = Строка.КоличествоФакт;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе
				НоваяСтрока = ТоварыИзменитьВПеремещении.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				НоваяСтрока.КодСтроки = 0;
				НоваяСтрока.Количество = Строка.КоличествоФакт;
				НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого Строка из Товары Цикл
			ПараметрыОтбора = Новый Структура("Номенклатура,Характеристика",Строка.Номенклатура,Строка.Характеристика);
			НайденныеСтроки = ДокументОснование.Товары.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()<>0 Тогда
				Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
					Если Строка.КоличествоФакт > 0 Тогда
						Если НайденнаяСтрока.Количество <= Строка.КоличествоФакт Тогда
                            НоваяСтрока1 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
						Если НайденнаяСтрока.Количество < Строка.КоличествоФакт Тогда
							НоваяСтрока2 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока2,НайденнаяСтрока);
							НоваяСтрока2.КодСтроки = 0;
							НоваяСтрока2.Количество = Строка.КоличествоФакт - НайденнаяСтрока.Количество;
							НоваяСтрока2.КоличествоУпаковок = Строка.КоличествоФакт - НайденнаяСтрока.Количество;
						КонецЕсли;
					    Иначе
						    НоваяСтрока1 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
							НоваяСтрока1.Количество = Строка.КоличествоФакт;
							НоваяСтрока1.КоличествоУпаковок = Строка.КоличествоФакт;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе
				НоваяСтрока = ТоварыИзменитьВПеремещении.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				НоваяСтрока.КодСтроки = 0;
				НоваяСтрока.Количество = Строка.КоличествоФакт;
				НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
   		

КонецПроцедуры
